{"words":[{"abode":"1. a place in which a person resides; residence; dwelling; habitation; home. 2. an extended stay in a place; sojourn."},{"aldermen":"1. a member of a municipal legislative body, especially of a municipal council. 2. (in England) one of the members, chosen by the elected councilors, in a borough or county council. 3. Early English History. a chief. (later) the chief magistrate of a county or group of counties. 4. Northern U.S. Slang. a pot belly."},{"alike":"1. in the same manner or form; similarly: They treated all customers alike. 2. to the same degree; equally: All three were guilty alike. 3. having resemblance or similarity; having or showing no marked or important difference: He thinks all politicians are alike."},{"astray":"1. out of the right way; off the correct or known road, path, or route: Despite specific instructions, they went astray and got lost. 2. away from that which is right; into error, confusion, or undesirable action or thought: They were led astray by their lust for money."},{"asunder":"1. into separate parts; in or into pieces: Lightning split the old oak tree asunder. 2. apart or widely separated: as wide asunder as the polar regions."},{"barer":"1. without covering or clothing; naked; nude: bare legs. 2. without the usual furnishings, contents, etc.: bare walls. 3. open to view; unconcealed; undisguised: his bare dislike of neckties. 4. unadorned; bald; plain: the bare facts. 5. (of cloth) napless or threadbare. 6. scarcely or just sufficient; mere: the bare necessities of life. 7. Obsolete. with the head uncovered; bareheaded. 8. to open to view; reveal or divulge: to bare one's arms; to bare damaging new facts."},{"basin":"1. a circular container with a greater width than depth, becoming smaller toward the bottom, used chiefly to hold water or other liquid, especially for washing. 2. any container of similar shape, as the pan of a balance. 3. the quantity held by such a container: We need another basin of water to dilute the mixture. 4. a natural or artificial hollow place containing water. 5. a partially enclosed, sheltered area along a shore, often partly man-made or dredged to a greater depth, where boats may be moored: a yacht basin. 6. Geology. an area in which the strata dip from the margins toward a common center. 7. Physical Geography. a hollow or depression in the earth's surface, wholly or partly surrounded by higher land: river basin. drainage basin. 8. Botany. the depression in an apple, pear, or other pome at the end opposite the stem."},{"beguiled":"1. to influence by trickery, flattery, etc.; mislead; delude. 2. to take away from by cheating or deceiving (usually followed by of): to be beguiled of money. 3. to charm or divert: a multitude of attractions to beguile the tourist. 4. to pass (time) pleasantly: beguiling the long afternoon with a good book."},{"berries":"1. any small, usually stoneless, juicy fruit, irrespective of botanical structure, as the huckleberry, strawberry, or hackberry. 2. Botany. a simple fruit having a pulpy pericarp in which the seeds are embedded, as the grape, gooseberry, currant, or tomato. 3. a dry seed or kernel, as of wheat. 4. the hip of the rose. 5. one of the eggs of a lobster, crayfish, etc. 6. the berries, Older Slang. someone or something very attractive or unusual. 7. to gather or pick berries: We went berrying this morning. 8. to bear or produce berries."},{"bestow":"1. to present as a gift; give; confer (usually followed by on or upon): The trophy was bestowed upon the winner. 2. to put to some use; apply: Time spent in study is time well bestowed. 3. Archaic. to provide quarters for; house; lodge. to put; stow; deposit; store."},{"blush":"1. to redden, as from embarrassment or shame: He blushed when they called him a conquering hero. 2. to feel shame or embarrassment (often followed by at or for): Your behavior makes me blush for your poor mother. 3. (of the sky, flowers, etc.) to become rosy. 4. (of new house paint or lacquer) to become cloudy or dull through moisture or excessive evaporation of solvents. 5. to make red; flush. 6. to make known by a blush: She could not help blushing the truth. 7. a reddening, as of the face. 8. rosy or pinkish tinge. 9. blusher (def 2). 10. Also called blush· wine·, rosé. 11. at first blush, without previous knowledge or adequate consideration; at first glance: At first blush, the solution to the problem seemed simple enough."},{"bonnet":"1. a hat, usually tying under the chin and often framing the face, formerly much worn by women but now worn mostly by children. 2. Informal. any hat worn by women. 3. Chiefly Scot. a man's or boy's cap. 4. a bonnetlike headdress: an Indian war bonnet. 5. any of various hoods, covers, or protective devices. 6. a cowl, hood, or wind cap for a fireplace or chimney, to stabilize the draft. 7. the part of a valve casing through which the stem passes and that forms a guide and seal for the stem. 8. a chamber at the top of a hot-air furnace from which the leaders emerge. 9. Chiefly British. an automobile hood. 10. Nautical. a supplementary piece of canvas laced to the foot of a fore-and-aft sail, especially a jib, in light winds. 11. to put a bonnet on."},{"bough":"1. a branch of a tree, especially one of the larger or main branches."},{"bowels":"1. Anatomy. Usually, bowels. the intestine. a part of the intestine. 2. bowels. the inward or interior parts: the bowels of the earth. Archaic. feelings of pity or compassion. 3. to disembowel."},{"bred":"1. simple past tense and past participle of breed."},{"calves":"1. plural of calf."},{"chink":"1. a crack, cleft, or fissure: a chink in a wall. 2. a narrow opening: a chink between two buildings. 3. to fill up chinks in."},{"cluck":"1. to utter the cry of a hen brooding or calling her chicks. 2. to make a similar sound; express concern, approval, etc., by such a sound. 3. to call or utter by clucking. 4. the sound uttered by a hen when brooding, or in calling her chicks. 5. any clucking sound."},{"clucked":"1. to utter the cry of a hen brooding or calling her chicks. 2. to make a similar sound; express concern, approval, etc., by such a sound. 3. to call or utter by clucking. 4. the sound uttered by a hen when brooding, or in calling her chicks. 5. any clucking sound."},{"clutching":"1. to seize with or as with the hands or claws; snatch: The bird swooped down and clutched its prey with its claws. 2. to grip or hold tightly or firmly: She clutched the child's hand as they crossed the street. 3. Slang. to spellbind; grip a person's emotions, attention, or interest: Garbo movies really clutch me. 4. to try to seize or grasp (usually followed by at): He clutched at the fleeing child. She clutched at the opportunity. 5. Slang. to become tense with fright; panic (sometimes followed by up): I clutched up on the math exam. 6. to operate the clutch in a vehicle. 7. the hand, claw, etc., when grasping. 8. Usually, clutches. power of disposal or control; mastery: She fell into the clutches of the enemy. 9. the act of clutching; a snatch or grasp. 10. a tight grip or hold. 11. a device for gripping something. 12. Automotive, Machinery. a mechanism for readily engaging or disengaging a shaft with or from another shaft or rotating part. Compare coupling (def 2a). a control, as a pedal, for operating this mechanism. 13. Sports. an extremely important or crucial moment of a game: He was famous for his coolness in pitching in the clutch. 14. any critical position or situation; emergency: She kept complete control in the clutch. 15. Also called clutch bag, clutch purse. a woman's small purse that can be carried in the hand and usually has no handle or strap. 16. done or accomplished in a critical situation: a clutch shot that won the basketball game. 17. dependable in crucial situations: a clutch player. 18. (of a coat) without fasteners; held closed in front by one's hand or arm."},{"conjuror":"1. a person who conjures spirits or practices magic; magician. 2. a person who practices legerdemain; juggler. 3. a person who solemnly charges or entreats."},{"covetous":"1. inordinately or wrongly desirous of wealth or possessions; greedy. 2. eagerly desirous."},{"cram":"1. to fill (something) by force with more than it can easily hold. 2. to force or stuff (usually followed by into, down, etc.). 3. to fill with or as with an excessive amount of food; overfeed. 4. Informal. to prepare (a person), as for an examination, by having him or her memorize information within a short period of time. to acquire knowledge of (a subject) by so preparing oneself. 5. Archaic. to tell lies to. 6. to eat greedily or to excess. 7. to study for an examination by memorizing facts at the last minute. 8. to press or force accommodation in a room, vehicle, etc., beyond normal or comfortable capacity; crowd; jam: The whole team crammed into the bus. 9. Informal. the act of cramming for an examination. 10. a crammed state. 11. a dense crowd; throng."},{"cuff":"1. a fold or band serving as a trimming or finish for the bottom of a sleeve. 2. a turned-up fold, as at the bottom of a trouser leg. 3. the part of a gauntlet or long glove that extends over the wrist. 4. a separate or detachable band or piece of fabric worn about the wrist, inside or outside of the sleeve. 5. an elasticized, ribbed, or reinforced band at the top of a sock or stocking. 6. a band of leather or other material, wider than a collar, sewed around the outside of the top of a shoe or boot to serve as a trimming or finish. 7. a handcuff. 8. Anatomy. a bandlike muscle or group of muscles encircling a body part. 9. Furniture. a horizontal strip of veneer used as an ornament on a leg. 10. Medicine\/Medical. an inflatable wrap placed around the upper arm and used in conjunction with a device for recording blood pressure. 11. to make a cuff or cuffs on: to cuff a pair of trousers. 12. to put handcuffs on. 13. off the cuff, Informal. extemporaneously; on the spur of the moment. unofficially or informally: I'm telling you this strictly off the cuff. 14. on the cuff, Slang. with the promise of future payment; on credit. without charge; with no payment expected: He enjoyed his meal the more because it was on the cuff."},{"dainties":"1. of delicate beauty; exquisite: a dainty lace handkerchief. 2. pleasing to the taste and, often, temptingly served or delicate; delicious: dainty pastries. 3. of delicate discrimination or taste; particular; fastidious: a dainty eater. 4. overly particular; finicky. 5. something delicious to the taste; a delicacy."},{"damp":"1. slightly wet; moist: damp weather; a damp towel. 2. unenthusiastic; dejected; depressed: The welcoming committee gave them a rather damp reception. 3. moisture; humidity; moist air: damp that goes through your warmest clothes. 4. a noxious or stifling vapor or gas, especially in a mine. 5. depression of spirits; dejection. 6. a restraining or discouraging force or factor. 7. to make damp; moisten. 8. to check or retard the energy, action, etc., of; deaden; dampen: A series of failures damped her enthusiasm. 9. to stifle or suffocate; extinguish: to damp a furnace. 10. Acoustics, Music. to check or retard the action of (a vibrating string); dull; deaden. 11. Physics. to cause a decrease in amplitude of (successive oscillations or waves). 12. damp off, to undergo damping-off."},{"damp":"1. slightly wet; moist: damp weather; a damp towel. 2. unenthusiastic; dejected; depressed: The welcoming committee gave them a rather damp reception. 3. moisture; humidity; moist air: damp that goes through your warmest clothes. 4. a noxious or stifling vapor or gas, especially in a mine. 5. depression of spirits; dejection. 6. a restraining or discouraging force or factor. 7. to make damp; moisten. 8. to check or retard the energy, action, etc., of; deaden; dampen: A series of failures damped her enthusiasm. 9. to stifle or suffocate; extinguish: to damp a furnace. 10. Acoustics, Music. to check or retard the action of (a vibrating string); dull; deaden. 11. Physics. to cause a decrease in amplitude of (successive oscillations or waves). 12. damp off, to undergo damping-off."},{"despairingly":"1. given to despair or hopelessness. 2. indicating despair: a despairing look."},{"despoil":"1. to strip of possessions, things of value, etc.; rob; plunder; pillage."},{"despondent":"1. feeling or showing profound hopelessness, dejection, discouragement, or gloom: despondent about failing health."},{"deuce":"1. Cards. a card having two pips; a two, or two-spot. 2. Dice. the face of a die having two pips. a cast or point of two. 3. Tennis. a situation, as a score of 40–40 in a game or 5–5 in a match, in which a player must score two successive points to win the game or two successive games to win the set. 4. Slang. a two-dollar bill. the sum of two dollars. 5. (especially in games, sports, and gambling) two."},{"dim":"1. not bright; obscure from lack of light or emitted light: a dim room; a dim flashlight. 2. not seen clearly or in detail; indistinct: a dim object in the distance. 3. not clear to the mind; vague: a dim idea. 4. not brilliant; dull in luster: a dim color. 5. not clear or distinct to the senses; faint: a dim sound. 6. not seeing clearly: eyes dim with tears. 7. tending to be unfavorable; not likely to happen, succeed, be favorable, etc.: a dim chance of winning. 8. not understanding clearly. 9. rather stupid; dim-witted. 10. to make dim or dimmer. 11. to switch (the headlights of a vehicle) from the high to the low beam. 12. to become or grow dim or dimmer. 13. dim out, (in wartime) to reduce the night illumination of (a city, ship, etc.) to make it less visible from the air or sea, as a protection from enemy aircraft or ships. 14. take a dim view of, to regard with disapproval, skepticism, or dismay: Her mother takes a dim view of her choice of friends."},{"dingy":"1. of a dark, dull, or dirty color or aspect; lacking brightness or freshness. 2. shabby; dismal."},{"dirge":"1. a funeral song or tune, or one expressing mourning in commemoration of the dead. 2. any composition resembling such a song or tune in character, as a poem of lament for the dead or solemn, mournful music: Tennyson's dirge for the Duke of Wellington. 3. a mournful sound resembling a dirge: The autumn wind sang the dirge of summer. 4. Ecclesiastical. the office of the dead, or the funeral service as sung."},{"dismal":"1. causing gloom or dejection; gloomy; dreary; cheerless; melancholy: dismal weather. 2. characterized by ineptness or lack of skill, competence, effectiveness, imagination, or interest; pitiful: Our team played a dismal game. 3. Obsolete. disastrous; calamitous. unlucky; sinister. 4. Southern U.S. a tract of swampy land, usually along the coast."},{"dismal":"1. causing gloom or dejection; gloomy; dreary; cheerless; melancholy: dismal weather. 2. characterized by ineptness or lack of skill, competence, effectiveness, imagination, or interest; pitiful: Our team played a dismal game. 3. Obsolete. disastrous; calamitous. unlucky; sinister. 4. Southern U.S. a tract of swampy land, usually along the coast."},{"dismay":"1. to break down the courage of completely, as by sudden danger or trouble; dishearten thoroughly; daunt: The surprise attack dismayed the enemy. 2. to surprise in such a manner as to disillusion: She was dismayed to learn of their disloyalty. 3. to alarm; perturb: The new law dismayed some of the more conservative politicians. 4. sudden or complete loss of courage; utter disheartenment. 5. sudden disillusionment. 6. agitation of mind; perturbation; alarm."},{"dovry":"ERROR: There aren't definitions for dovry. Perhaps a mispelling?"},{"dowerless":"1. Law. the portion of a deceased husband's real property allowed to his widow for her lifetime. 2. dowry (def 1). 3. a natural gift or endowment. 4. to provide with a dower or dowry. 5. to give as a dower or dowry."},{"dreary":"1. causing sadness or gloom. 2. dull; boring. 3. sorrowful; sad."},{"dreary":"1. causing sadness or gloom. 2. dull; boring. 3. sorrowful; sad."},{"droll":"1. amusing in an odd way; whimsically humorous; waggish. 2. a droll person; jester; wag. 3. Archaic. to jest; joke."},{"dull":"1. not sharp; blunt: a dull knife. 2. causing boredom; tedious; uninteresting: a dull sermon. 3. not lively or spirited; listless. 4. not bright, intense, or clear; dim: a dull day; a dull sound. 5. having very little depth of color; lacking in richness or intensity of color. 6. slow in motion or action; not brisk; sluggish: a dull day in the stock market. 7. mentally slow; lacking brightness of mind; somewhat stupid; obtuse. 8. lacking keenness of perception in the senses or feelings; insensible; unfeeling. 9. not intense or acute: a dull pain. 10. to make or become dull."},{"dusted":"1. earth or other matter in fine, dry particles. 2. a cloud of finely powdered earth or other matter in the air. 3. any finely powdered substance, as sawdust. 4. the ground; the earth's surface. 5. the substance to which something, as the dead human body, is ultimately reduced by disintegration or decay; earthly remains. 6. British. ashes, refuse, etc. junk1 (def 1). 7. a low or humble condition. 8. anything worthless. 9. disturbance; turmoil. 10. gold dust. 11. the mortal body of a human being. 12. a single particle or grain. 13. Archaic. money; cash. 14. to wipe the dust from: to dust a table. 15. to sprinkle with a powder or dust: to dust rosebushes with an insecticide. 16. to strew or sprinkle (a powder, dust, or other fine particles): to dust insecticide on a rosebush. 17. to soil with dust; make dusty. 18. to wipe dust from furniture, woodwork, etc. 19. to become dusty. 20. to apply dust or powder to a plant, one's body, etc.: to dust with an insecticide in late spring. 21. bite the dust, to be killed, especially in battle; die. to suffer defeat; be unsuccessful; fail: Another manufacturer has bitten the dust. 22. dust off, Baseball. (of a pitcher) to throw the ball purposely at or dangerously close to (the batter). to take out or prepare for use again, as after a period of inactivity or storage: I'm going to dust off my accounting skills and try to get a job in the finance department. to beat up badly: The gang of hoodlums dusted off a cop. 23. leave one in the dust, to overtake and surpass a competitor or one who is less ambitious, qualified, etc.: Don't be so meek, they'll leave you in the dust. 24. lick the dust, to be killed; die. to humble oneself abjectly; grovel: He will resign rather than lick the dust. 25. make the dust fly, to execute with vigor or speed: We turned them loose on the work, and they made the dust fly. 26. shake the dust from one's feet, to depart in anger or disdain; leave decisively or in haste, especially from an unpleasant situation: As the country moved toward totalitarianism, many of the intelligentsia shook the dust from their feet. 27. throw dust in someone's eyes, to mislead; deceive: He threw dust in our eyes by pretending to be a jeweler and then disappeared with the diamonds."},{"exceedingly":"1. to an unusual degree; very; extremely: The children were doing exceedingly well in school."},{"exerted":"1. to put forth or into use, as power; exercise, as ability or influence; put into vigorous action: to exert every effort. 2. to put (oneself) into strenuous, vigorous action or effort."},{"faze":"1. to cause to be disturbed or disconcerted; daunt: The worst insults cannot faze him."},{"fetter":"1. a chain or shackle placed on the feet. 2. Usually, fetters. anything that confines or restrains: Boredom puts fetters upon the imagination. 3. to put fetters upon. 4. to confine; restrain."},{"flint":"1. a hard stone, a form of silica resembling chalcedony but more opaque, less pure, and less lustrous. 2. a piece of this, especially as used for striking fire. 3. a chunk of this used as a primitive tool or as the core from which such a tool was struck. 4. something very hard or unyielding. 5. a small piece of metal, usually an iron alloy, used to produce a spark to ignite the fuel in a cigarette lighter. 6. to furnish with flint."},{"flowery":"1. covered with or having many flowers. 2. decorated with floral designs. 3. rhetorically ornate or precious: flowery language. 4. resembling a flower in fragrance: a Rhine wine with a flowery aroma."},{"forbearance":"1. the act of forbearing; a refraining from something. 2. forbearing conduct or quality; patient endurance; self-control. 3. an abstaining from the enforcement of a right. 4. a creditor's giving of indulgence after the day originally fixed for payment."},{"forevermore":"1. forever hereafter."},{"fowl":"1. the domestic or barnyard hen or rooster; chicken. Compare domestic fowl. 2. any of several other, usually gallinaceous, birds that are barnyard, domesticated, or wild, as the duck, turkey, or pheasant. 3. (in market and household use) a full-grown domestic fowl for food purposes, as distinguished from a chicken or young fowl. 4. the flesh or meat of a domestic fowl. 5. any bird (used chiefly in combination): waterfowl; wildfowl. 6. to hunt or take wildfowl."},{"frail":"1. having delicate health; not robust; weak: My grandfather is rather frail now. 2. easily broken or destroyed; fragile. 3. morally weak; easily tempted. 4. Older Slang: Sometimes Offensive. a term used to refer to a girl or woman."},{"fuzzy":"1. of the nature of or resembling fuzz: a soft, fuzzy material. 2. covered with fuzz: a plant with broad, fuzzy leaves. 3. indistinct; blurred: A fuzzy photograph usually means you jiggled the camera. 4. muddleheaded or incoherent: a fuzzy thinker; to become fuzzy after one drink."},{"gainsay":"1. to deny, dispute, or contradict. 2. to speak or act against; oppose."},{"gait":"1. a manner of walking, stepping, or running. 2. any of the manners in which a horse moves, as a walk, trot, canter, gallop, or rack. 3. to teach a specified gait or gaits to (a horse)."},{"garret":"1. an attic, usually a small, wretched one."},{"gruff":"1. low and harsh; hoarse: a gruff voice. 2. rough, brusque, or surly: a gruff manner."},{"haggard":"1. having a gaunt, wasted, or exhausted appearance, as from prolonged suffering, exertion, or anxiety; worn: the haggard faces of the tired troops. 2. wild; wild-looking: haggard eyes. 3. Falconry. (especially of a hawk caught after it has attained adult plumage) untamed. 4. Falconry. a wild or untamed hawk caught after it has assumed adult plumage."},{"hail":"1. to cheer, salute, or greet; welcome. 2. to acclaim; approve enthusiastically: The crowds hailed the conquerors. They hailed the recent advances in medicine. 3. to call out to in order to stop, attract attention, ask aid, etc.: to hail a cab. 4. to call out in order to greet, attract attention, etc.: The people on land hailed as we passed in the night. 5. a shout or call to attract attention: They answered the hail of the marooned boaters. 6. a salutation or greeting: a cheerful hail. 7. the act of hailing. 8. (used as a salutation, greeting, or acclamation.) 9. hail from, to have as one's place of birth or residence: Nearly everyone here hails from the Midwest. 10. within hail, within range of hearing; audible: The mother kept her children within hail of her voice."},{"hallowed":"1. regarded as holy; venerated; sacred: Hallowed be Thy name; the hallowed saints; our hallowed political institutions."},{"haunted":"1. inhabited or frequented by ghosts: a haunted castle. 2. preoccupied, as with an emotion, memory, or idea; obsessed: His haunted imagination gave him no peace. 3. disturbed; distressed; worried: Haunted by doubt he again turned to law books on the subject."},{"heaped":"1. a group of things placed, thrown, or lying one on another; pile: a heap of stones. 2. Informal. a great quantity or number; multitude: a heap of people. 3. Slang. an automobile, especially a dilapidated one. 4. to gather, put, or cast in a heap; pile (often followed by up, on, together, etc.). 5. to accumulate or amass (often followed by up or together): to heap up riches. 6. to give, assign, or bestow in great quantity; load (often followed by on or upon): to heap blessings upon someone; to heap someone with work. 7. to load, supply, or fill abundantly: to heap a plate with food. 8. to become heaped or piled, as sand or snow; rise in a heap or heaps (often followed by up). 9. all of a heap, Informal. overwhelmed with astonishment; amazed: We were struck all of a heap upon hearing of their divorce. suddenly; abruptly: All of a heap the room was empty."},{"hearse":"1. a vehicle for conveying a dead person to the place of burial. 2. a triangular frame for holding candles, used at the service of Tenebrae in Holy Week. 3. a canopy erected over a tomb."},{"heed":"1. to give careful attention to: He did not heed the warning. 2. to give attention; have regard. 3. careful attention; notice; observation (usually with give or take)."},{"herd":"1. a number of animals kept, feeding, or traveling together; drove; flock: a herd of cattle; a herd of sheep; a herd of zebras. 2. Sometimes Disparaging. a large group of people: The star was mobbed by a herd of autograph seekers. 3. any large quantity: a herd of bicycles. 4. the herd, the common people; masses; rabble: He had no opinions of his own, but simply followed the herd. 5. to unite or go in a herd; assemble or associate as a herd. 6. ride herd on, to have charge or control of; maintain discipline over: He rode herd on 40 students in each class."},{"hob":"1. a projection or shelf at the back or side of a fireplace, used for keeping food warm. 2. a rounded peg or pin used as a target in quoits and similar games. 3. a game in which such a peg is used. 4. Machinery. a milling cutter for gear and sprocket teeth, splines, threads, etc., having helically arranged teeth and fed across the work as the work is rotated. 5. Machinery. to cut with a hob."},{"hog":"1. a hoofed mammal of the family Suidae, order Artiodactyla, comprising boars and swine. 2. a domesticated swine weighing 120 pounds (54 kg) or more, raised for market. 3. a selfish, gluttonous, or filthy person. 4. Slang. a large, heavy motorcycle. an impressively large luxury automobile. 5. Also, hogg, hogget. British. a sheep about one year old that has not been shorn. the wool shorn from such a sheep. any of several other domestic animals, as a bullock, that are one year old. 6. Railroads Slang. a locomotive. 7. a machine for shredding wood. 8. Curling. a stone that stops before reaching the hog score. 9. to appropriate selfishly; take more than one's share of. 10. to arch (the back) upward like that of a hog. 11. roach3 (def 3). 12. (in machine-shop practice) to cut deeply into (a metal bar or slab) to reduce it to a shape suitable for final machining. 13. to shred (a piece of wood). 14. Nautical. (of a hull) to have less than the proper amount of sheer because of structural weakness; arch. Compare sag (def 6a). 15. go the whole hog, to proceed or indulge completely and unreservedly: We went the whole hog and took a cruise around the world. Also, go whole hog. 16. live high off \/ on the hog, to be in prosperous circumstances. Also, eat high off the hog."},{"holly":"1. any of numerous trees or shrubs of the genus Ilex, as I. opaca (American holly) the state tree of Delaware, or I. aquifolium (English holly) having glossy, spiny-toothed leaves, small, whitish flowers, and red berries. 2. the foliage and berries, used for decoration, especially during the Christmas season."},{"humbug":"1. something intended to delude or deceive. 2. the quality of falseness or deception. 3. a person who is not what he or she claims or pretends to be; impostor. 4. something devoid of sense or meaning; nonsense: a humbug of technical jargon. 5. British. a variety of hard mint candy. 6. to impose upon by humbug or false pretense; delude; deceive. 7. to practice humbug. 8. nonsense!"},{"ill":"1. of unsound physical or mental health; unwell; sick: She felt ill, so her teacher sent her to the nurse. 2. objectionable; unsatisfactory; poor; faulty: ill manners. 3. hostile; unkindly: ill feeling. 4. evil; wicked; bad: of ill repute. 5. unfavorable; adverse: ill fortune. 6. of inferior worth or ability; unskillful; inexpert: an ill example of scholarship. 7. an unfavorable opinion or statement: I can speak no ill of her. 8. harm or injury: His remarks did much ill. 9. trouble, distress, or misfortune: Many ills befell him. 10. evil: to know the difference between good and ill. 11. sickness or disease. 12. in an ill manner. 13. unsatisfactorily; poorly: It ill befits a man to betray old friends. 14. in a hostile or unfriendly manner. 15. unfavorably; unfortunately. 16. with displeasure or offense. 17. faultily; improperly. 18. with difficulty or inconvenience; scarcely: Buying a new car is an expense we can ill afford. 19. ill at ease, socially uncomfortable; nervous: They were ill at ease because they didn't speak the language."},{"instalments":"1. any of several parts into which a debt or other sum payable is divided for payment at successive fixed times: to pay for furniture in monthly installments. 2. a single portion of something furnished or issued by parts at successive times: a magazine serial in six installments."},{"irk":"1. to irritate, annoy, or exasperate: It irked him to wait in line."},{"ironmongery":"1. a hardware store or business. 2. the stock of a hardware store; hardware."},{"keenly":"1. finely sharpened, as an edge; so shaped as to cut or pierce substances readily: a keen razor. 2. sharp, piercing, or biting: a keen wind; keen satire. 3. characterized by strength and distinctness of perception; extremely sensitive or responsive: keen eyes; keen ears. 4. having or showing great mental penetration or acumen: keen reasoning; a keen mind. 5. animated by or showing strong feeling or desire: keen competition. 6. intense, as feeling or desire: keen ambition; keen jealousy. 7. eager; interested; enthusiastic (often followed by about, on, etc., or an infinitive): She is really keen on going swimming. 8. Slang. great; wonderful; marvelous."},{"kerchief":"1. a woman's square scarf worn as a covering for the head or sometimes the shoulders. 2. a handkerchief."},{"lads":"1. a boy or youth. 2. Informal. a familiar or affectionate term of address for a man; chap. 3. British Horseracing Informal. a stable boy."},{"laths":"1. a thin, narrow strip of wood, used with other strips to form latticework, a backing for plaster or stucco, a support for slates and other roofing materials, etc. 2. a group or quantity of such strips. 3. work consisting of such strips. 4. wire mesh or the like used in place of wooden laths as a backing for plasterwork. 5. a thin, narrow, flat piece of wood used for any purpose. 6. to cover or line with laths."},{"linger":"1. to remain or stay on in a place longer than is usual or expected, as if from reluctance to leave: We lingered awhile after the party. 2. to remain alive; continue or persist, although gradually dying, ceasing, disappearing, etc.: She lingered a few months after the heart attack. Such practices still linger among the older natives. 3. to dwell in contemplation, thought, or enjoyment: to linger over the beauty of a painting. 4. to be tardy in action; delay; dawdle: to linger in discharging one's duties. 5. to walk slowly; saunter along. 6. to pass (time, life, etc.) in a leisurely or a tedious manner (usually followed by away or out): We lingered away the whole summer at the beach. 7. Archaic. to draw out or protract."},{"livery":"1. a distinctive uniform, badge, or device formerly provided by someone of rank or title for his retainers, as in time of war. 2. a uniform worn by servants. 3. distinctive attire worn by an official, a member of a company or guild, etc. 4. Also called livery company. British. a guild or company of the City of London entitled to wear such livery. 5. characteristic dress, garb, or outward appearance: the green livery of summer. 6. the care, feeding, stabling, etc., of horses for pay. 7. livery stable. 8. a company that rents out automobiles, boats, etc. 9. Law. an ancient method of conveying a freehold by formal delivery of possession."},{"loath":"1. unwilling; reluctant; disinclined; averse: to be loath to admit a mistake."},{"lofty":"1. extending high in the air; of imposing height; towering: lofty mountains. 2. exalted in rank, dignity, or character; eminent. 3. elevated in style, tone, or sentiment, as writings or speech. 4. arrogantly or condescendingly superior in manner; haughty: to treat someone in a lofty manner. 5. Nautical. noting a rig of a sailing ship having extraordinarily high masts. 6. (of fabric or yarn) thick and resilient."},{"loom":"1. a hand-operated or power-driven apparatus for weaving fabrics, containing harnesses, lay, reed, shuttles, treadles, etc. 2. the art or the process of weaving. 3. the part of an oar between the blade and the handle. 4. to weave (something) on a loom."},{"lopsided":"1. heavier, larger, or more developed on one side than on the other; unevenly balanced; unsymmetrical. 2. leaning to one side."},{"lurk":"1. to lie or wait in concealment, as a person in ambush; remain in or around a place secretly or furtively. 2. to go furtively; slink; steal. 3. to exist unperceived or unsuspected. 4. Chiefly Computers. to read or observe an ongoing discussion without participating in it, as in an Internet newsgroup. 5. an underhand scheme; dodge. 6. an easy, somewhat lazy or unethical way of earning a living, performing a task, etc. 7. a hideout."},{"lustrous":"1. having luster; shining; luminous: lustrous eyes. 2. brilliant; splendid; resplendent; illustrious: a lustrous career."},{"lusty":"1. full of or characterized by healthy vigor. 2. hearty, as a meal. 3. spirited; enthusiastic. 4. lustful; lecherous."},{"maim":"1. to deprive of the use of some part of the body by wounding or the like; cripple: The explosion maimed him for life. 2. to impair; make essentially defective: The essay was maimed by deletion of important paragraphs. 3. a physical injury, especially a loss of a limb. 4. an injury or defect; blemish; lack."},{"morose":"1. gloomily or sullenly ill-humored, as a person or mood. 2. characterized by or expressing gloom."},{"mossy":"1. overgrown with or abounding in moss: a mossy stone. 2. covered with a mosslike growth. 3. appearing as if covered with moss. 4. resembling moss: a mossy softness. 5. old or outdated; antiquated: mossy ideas."},{"mossy":"1. overgrown with or abounding in moss: a mossy stone. 2. covered with a mosslike growth. 3. appearing as if covered with moss. 4. resembling moss: a mossy softness. 5. old or outdated; antiquated: mossy ideas."},{"mourner":"1. a person who mourns. 2. a person who attends a funeral to mourn for the deceased. 3. (at religious revival meetings) a person who professes penitence for sin, with desire for salvation."},{"negus":"1. a title of Ethiopian royalty. 2. (initial capital letter) the Emperor of Ethiopia."},{"nip":"1. to squeeze or compress tightly between two surfaces or points; pinch; bite. 2. to take off by pinching, biting, or snipping (usually followed by off): He nipped off a piece of steak and gave it to the dog. 3. to check in growth or development. 4. to affect sharply and painfully or injuriously, as a very cold temperature: a cold wind that nips the fingers. 5. Informal. to snatch away suddenly. 6. Informal. to defeat (an opponent) by a very close margin; edge. 7. Informal. to steal or pilfer. 8. Nautical. (of ice) to press (a ship) from opposite sides. to seize (a taut rope) to another rope. 9. Chiefly British Slang. to leave stealthily; sneak away; flee (often followed by away). 10. an act of nipping; a pinch or small bite: The dog took several nips at our heels. 11. a biting quality, as in cold or frosty air: There's a nip in the air this morning. 12. sharp cold; a sharp touch of frost: The trees had felt the first nip of winter. 13. a sharp or biting remark. 14. a biting taste or tang, especially in some cheese. 15. a small bit or quantity of anything: a nip of bread to stave off hunger. 16. Nautical. an abrupt turn or twist in a rope. a part of a rope or chain bound by a seizing or nipper. 17. Usually, nips. nipper (def 2). 18. nip and tuck, with each competitor equaling or closely contesting the speed, scoring, or efforts of the other: It was nip and tuck as to which sailboat would reach port first. 19. nip in the bud. bud1 (def 11)."},{"notwithstanding":"1. in spite of; without being opposed or prevented by: Notwithstanding a brilliant defense, he was found guilty. She went to the game anyway, doctor's orders notwithstanding. 2. in spite of the fact that; although: It was the same material, notwithstanding the texture seemed different. 3. nevertheless; anyway; yet: We were invited notwithstanding."},{"notwithstanding":"1. in spite of; without being opposed or prevented by: Notwithstanding a brilliant defense, he was found guilty. She went to the game anyway, doctor's orders notwithstanding. 2. in spite of the fact that; although: It was the same material, notwithstanding the texture seemed different. 3. nevertheless; anyway; yet: We were invited notwithstanding."},{"onslaught":"1. an onset, assault, or attack, especially a vigorous one."},{"pageant":"1. an elaborate public spectacle illustrative of the history of a place, institution, or the like, often given in dramatic form or as a procession of colorful floats. 2. a costumed procession, masque, allegorical tableau, or the like forming part of public or social festivities. 3. a show or exhibition, especially one consisting of a succession of participants or events: a beauty pageant. 4. something comparable to a procession in colorful variety, splendor, or grandeur: the pageant of Renaissance history. 5. a pretentious display or show that conceals a lack of real importance or meaning. 6. (in medieval times) a platform or stage, usually moving on wheels, on which scenes from mystery plays were presented. 7. display or pageantry. 8. Obsolete. a stage bearing any kind of spectacle."},{"pangs":"1. a sudden feeling of mental or emotional distress or longing: a pang of remorse; a pang of desire. 2. a sudden, brief, sharp pain or physical sensation; spasm: hunger pangs."},{"pelt":"1. to attack or assail with repeated blows or with missiles. 2. to throw (missiles). 3. to drive by blows or missiles: The child pelted the cows home from the fields. 4. to assail vigorously with words, questions, etc. 5. to beat or rush against with repeated forceful blows: The wind and rain pelted the roofs and walls of the houses for four days. 6. to strike blows; beat with force or violence. 7. to throw missiles. 8. to hurry. 9. to beat or pound unrelentingly: The wind, rain, and snow pelted against the castle walls. 10. to cast abuse. 11. the act of pelting. 12. a vigorous stroke; whack. 13. a blow with something thrown. 14. speed. 15. an unrelenting or repeated beating, as of rain or wind."},{"pelting":"1. paltry; petty; mean."},{"pillage":"1. to strip ruthlessly of money or goods by open violence, as in war; plunder: The barbarians pillaged every conquered city. 2. to take as booty. 3. to rob with open violence; take booty: Soldiers roamed the countryside, pillaging and killing. 4. the act of plundering, especially in war. 5. booty or spoil."},{"plight":"1. a condition, state, or situation, especially an unfavorable or unfortunate one: to find oneself in a sorry plight."},{"pommel":"1. a knob, as on the hilt of a sword. 2. the protuberant part at the front and top of a saddle. 3. Architecture. a spherical ornament or finial. 4. Gymnastics. either of the two curved handles on the top surface of a side horse. 5. to beat or strike with or as if with the fists or a pommel."},{"poplar":"1. any of the rapidly growing, salicaceous trees of the genus Populus, usually characterized by the columnar or spirelike manner of growth of its branches. 2. the light, soft wood of any of these trees, used for pulp. 3. any of various similar trees, as the tulip tree. 4. the wood of any such tree."},{"porter":"1. a person hired to carry burdens or baggage, as at a railroad station or a hotel. 2. a person who does cleaning and maintenance work in a building, factory, store, etc. 3. an attendant in a railroad parlor car or sleeping car."},{"preposterous":"1. completely contrary to nature, reason, or common sense; absurd; senseless; utterly foolish: a preposterous tale."},{"profligate":"1. utterly and shamelessly immoral or dissipated; thoroughly dissolute. 2. recklessly prodigal or extravagant. 3. a profligate person."},{"ramp":"1. a sloping surface connecting two levels; incline. 2. a short concave slope or bend, as one connecting the higher and lower parts of a staircase railing at a landing. 3. any extensive sloping walk or passageway. 4. the act of ramping. 5. Also called boarding ramp. a movable staircase for entering or leaving a cabin door of an airplane. 6. Also called parking ramp. apron (def 6). 7. (of animals) to stand or move with the forelegs or arms raised, as in animosity or excitement. 8. (of a lion or other large quadruped represented on a coat of arms) to rise or stand on the hind legs. 9. to rear as if to spring. 10. to leap or dash with fury (often followed by about). 11. to act violently; rage; storm: ramping and raging in a great fury. 12. to provide with a ramp or ramps: Entrances will be ramped to accommodate those in wheelchairs. 13. ramp along, Nautical. to sail on a tack with all sails filled."},{"rashly":"1. acting or tending to act too hastily or without due consideration. 2. characterized by or showing too great haste or lack of consideration: rash promises."},{"reeking":"1. a strong, unpleasant smell. 2. vapor or steam. 3. to smell strongly and unpleasantly. 4. to be strongly pervaded with something unpleasant or offensive. 5. to give off steam, smoke, etc. 6. to be wet with sweat, blood, etc. 7. to give off; emit; exude. 8. to expose to or treat with smoke."},{"rejoices":"1. to be glad; take delight (often followed by in): to rejoice in another's happiness. 2. to make joyful; gladden: a song to rejoice the heart."},{"relate":"1. to tell; give an account of (an event, circumstance, etc.). 2. to bring into or establish association, connection, or relation: to relate events to probable causes. 3. to have reference (often followed by to). 4. to have some relation (often followed by to). 5. to establish a social or sympathetic relationship with a person or thing: two sisters unable to relate to each other."},{"relinquish":"1. to renounce or surrender (a possession, right, etc.): to relinquish the throne. 2. to give up; put aside or desist from: to relinquish a plan. 3. to let go; release: to relinquish one's hold."},{"relished":"1. liking or enjoyment of the taste of something. 2. pleasurable appreciation of anything; liking: He has no relish for obscene jokes. 3. Cookery. something savory or appetizing added to a meal, as pickles or olives. a sweet pickle made of various vegetables, usually chopped or minced. an appetizer or hors d'oeuvre. 4. a pleasing or appetizing flavor. 5. a pleasing or enjoyable quality. 6. a taste or flavor. 7. a smack, trace, or touch of something. 8. to take pleasure in; like; enjoy: I don't relish the long drive home. 9. to make pleasing to the taste. 10. to like the taste of. 11. to have taste or flavor. 12. to be agreeable."},{"repentance":"1. deep sorrow, compunction, or contrition for a past sin, wrongdoing, or the like. 2. regret for any past action."},{"repenting":"1. to feel sorry, self-reproachful, or contrite for past conduct; regret or be conscience-stricken about a past action, attitude, etc. (often followed by of): He repented after his thoughtless act. 2. to feel such sorrow for sin or fault as to be disposed to change one's life for the better; be penitent. 3. to remember or regard with self-reproach or contrition: to repent one's injustice to another. 4. to feel sorry for; regret: to repent an imprudent act."},{"retentive":"1. tending or serving to retain something. 2. having power or capacity to retain. 3. having power or ability to remember; having a good memory."},{"rime":"1. Also called rime ice. an opaque coating of tiny, white, granular ice particles, caused by the rapid freezing of supercooled water droplets on impact with an object. Compare frost (def 2), glaze (def 17). 2. to cover with rime or hoarfrost."},{"rove":"1. to wander about without definite destination; move hither and thither at random, especially over a wide area. 2. to wander over or through; traverse: to rove the woods. 3. an act or instance of roving."},{"ruddy":"1. of or having a fresh, healthy red color: a ruddy complexion. 2. red or reddish. 3. British Slang. damned: a ruddy fool. 4. British Slang. damned: He'd ruddy well better be there."},{"sallied":"1. a sortie of troops from a besieged place upon an enemy. 2. a sudden rushing forth or activity. 3. an excursion or trip, usually off the main course. 4. an outburst or flight of passion, fancy, etc.: a sally of anger. 5. a clever, witty, or fanciful remark. 6. Carpentry. a projection, as of the end of a rafter beyond the notch by which the rafter is fitted over the wall plate. 7. to make a sally, as a body of troops from a besieged place. 8. to set out on a side trip or excursion. 9. to set out briskly or energetically. 10. (of things) to issue forth."},{"saucepan":"1. a metal container of moderate depth, usually having a long handle and sometimes a cover, for stewing, boiling, etc."},{"savor":"1. the quality in a substance that affects the sense of taste or of smell. 2. a particular taste or smell. 3. distinctive quality or property. 4. power to excite or interest. 5. Archaic. repute. 6. to have savor, taste, or odor. 7. to exhibit the peculiar characteristics; smack (often followed by of): His business practices savor of greed. 8. to give a savor to; season; flavor. 9. to perceive by taste or smell, especially with relish: to savor the garden's odors. 10. to give oneself to the enjoyment of: to savor the best in life."},{"scaling":"1. the removal of calculus and other deposits on the teeth by means of instruments."},{"scrub":"1. to rub hard with a brush, cloth, etc., or against a rough surface in washing. 2. to subject to friction; rub. 3. to remove (dirt, grime, etc.) from something by hard rubbing while washing. 4. Chemistry. to remove (impurities or undesirable components) from a gas by chemical means, as sulfur dioxide from smokestack gas or carbon dioxide from exhaled air in life-support packs. 5. to cancel or postpone (a space flight or part of a mission): Ground control scrubbed the spacewalk. 6. Slang. to do away with; cancel: Scrub your vacation plans—there's work to do! 7. to cleanse something by hard rubbing. 8. to cleanse one's hands and arms as a preparation to performing or assisting in surgery (often followed by up). 9. an act or instance of scrubbing. 10. a canceled or postponed space flight, launching, scheduled part of a space mission, etc. 11. something, as a cosmetic preparation, used for scrubbing."},{"sharp":"1. having a thin cutting edge or a fine point; well-adapted for cutting or piercing: a sharp knife. 2. terminating in an edge or point; not blunt or rounded: The table had sharp corners. 3. involving a sudden or abrupt change in direction or course: a sharp curve in the road; The car made a sharp turn. 4. abrupt, as an ascent: a sharp drop. 5. consisting of angular lines and pointed forms or of thin, long features: He had a sharp face. 6. clearly defined; distinct: a sharp photographic image. 7. distinct or marked, as a contrast: sharp differences of opinion. 8. pungent or biting in taste: a sharp cheese. 9. piercing or shrill in sound: a sharp cry. 10. keenly cold, as weather: a sharp, biting wind. 11. felt acutely; intense; distressing: sharp pain. 12. merciless, caustic, or harsh: sharp words. 13. fierce or violent: a sharp struggle. 14. keen or eager: sharp desire. 15. quick, brisk, or spirited. 16. alert or vigilant: They kept a sharp watch for the enemy. 17. mentally acute: a sharp lad. 18. extremely sensitive or responsive; keen: sharp vision; sharp hearing. 19. shrewd or astute: a sharp bargainer. 20. shrewd to the point of dishonesty: sharp practice. 21. Music. (of a tone) raised a chromatic half step in pitch: F sharp. above an intended pitch, as a note; too high (opposed to flat). 22. Informal. very stylish: a sharp dresser; a sharp jacket. 23. Radio, Electronics. of, relating to, or responsive to a very narrow range of frequencies. Compare broadband. 24. Phonetics. fortis; voiceless. 25. composed of hard, angular grains, as sand. 26. Music. to raise in pitch, especially by one chromatic half step. 27. to sound above the true pitch. 28. keenly or acutely. 29. abruptly or suddenly: to pull a horse up sharp. 30. punctually: Meet me at one o'clock sharp. 31. vigilantly. 32. briskly; quickly. 33. Music. above the true pitch: You're singing a little sharp. 34. something sharp. 35. Usually, sharps. a medium-length needle with a rounded eye and a sharp point, used for all-purpose hand sewing. 36. a sharper. 37. Informal. an expert. 38. Music. a tone one chromatic half step above a given tone. (in musical notation) the symbol ♯ indicating this."},{"sheen":"1. luster; brightness; radiance. 2. gleaming attire. 3. shining. 4. beautiful. 5. Scot. and North England. to shine."},{"shivering":"1. to shake or tremble with cold, fear, excitement, etc. 2. Nautical. (of a fore-and-aft sail) to shake when too close to the wind. (of a sailing vessel) to be headed so close to the wind that the sails shake. 3. a tremulous motion; a tremble or quiver: The thought sent a shiver down her spine. 4. shivers, an attack of shivering or chills (usually preceded by the)."},{"shone":"1. a simple past tense and past participle of shine."},{"shrewdly":"1. astute or sharp in practical matters: a shrewd politician. 2. keen; piercing. 3. artful. 4. Archaic. malicious. 5. Obsolete, bad. 6. Obsolete, shrewish."},{"shriveled":"1. to contract and wrinkle, as from great heat, cold, or dryness. 2. to wither; make or become helpless or useless."},{"shun":"1. to keep away from (a place, person, object, etc.), from motives of dislike, caution, etc.; take pains to avoid."},{"sipping":"1. to drink (a liquid) a little at a time; take small tastes of: He sipped the hot tea noisily. 2. to drink from a little at a time: The bird sipped the flower. 3. to take in; absorb: to sip knowledge at its source. 4. to drink by sips. 5. an instance of sipping; a small taste of a liquid: One sip told me that the milk was sour. 6. a small quantity taken by sipping: Take just a sip, not a gulp or a swallow."},{"sleet":"1. precipitation in the form of ice pellets created by the freezing of rain as it falls (distinguished from hail). 2. glaze (def 17). 3. Chiefly British. a mixture of rain and snow. 4. to send down sleet. 5. to fall as or like sleet."},{"slyly":"1. cunning or wily: sly as a fox. 2. stealthy, insidious, or secret. 3. playfully artful, mischievous, or roguish: sly humor. 4. on the sly, secretly; furtively: a tryst on the sly."},{"smears":"1. to spread or daub (an oily, greasy, viscous, or wet substance) on or over something: to smear butter on bread. 2. to spread or daub an oily, greasy, viscous, or wet substance on: to smear bread with butter. 3. to stain, spot, or make dirty with something oily, greasy, viscous, or wet. 4. to sully, vilify, or soil (a reputation, good name, etc.). 5. to smudge or blur, as by rubbing: The signature was smeared. 6. Slang. to defeat decisively; overwhelm: They smeared the home team. 7. an oily, greasy, viscous, or wet substance, especially a dab of such a substance. 8. a stain, spot, or mark made by such a substance. 9. a smudge. 10. something smeared or to be smeared on a thing, as a glaze for pottery. 11. a small quantity of something spread thinly on a slide for microscopic examination. 12. vilification: a smear by a cheap gossip columnist."},{"snug":"1. warmly comfortable or cozy, as a place, accommodations, etc.: a snug little house. 2. fitting closely, as a garment: a snug jacket. 3. more or less compact or limited in size, and sheltered or warm: a snug harbor. 4. trim, neat, or compactly arranged, as a ship or its parts. 5. comfortably circumstanced, as persons. 6. pleasant or agreeable, especially in a small, exclusive way: a snug coterie of writers. 7. enabling one to live in comfort: a snug fortune. 8. secret; concealed; well-hidden: a snug hideout. 9. to lie closely or comfortably; nestle. 10. to make snug. 11. Nautical. to prepare for a storm by taking in sail, lashing deck gear, etc. (usually followed by down). 12. in a snug manner: The shirt fit snug around the neck. 13. British. a small, secluded room in a tavern, as for private parties."},{"spark":"1. an ignited or fiery particle such as is thrown off by burning wood or produced by one hard body striking against another. 2. Also called sparkover. Electricity. the light produced by a sudden discontinuous discharge of electricity through air or another dielectric. the discharge itself. any electric arc of relatively small energy content. the electric discharge produced by a spark plug in an internal-combustion engine. 3. anything that activates or stimulates; inspiration or catalyst. 4. a small amount or trace of something. 5. a trace of life or vitality. 6. sparks, (used with a singular verb) Slang. a radio operator on a ship or aircraft. 7. (usually initial capital letter) a member of Camp Fire, Inc., who is five years of age. 8. to emit or produce sparks. 9. to issue as or like sparks. 10. to send forth gleams or flashes. 11. (of the ignition of an internal-combustion engine) to function correctly in producing sparks. 12. to kindle, animate, or stimulate (interest, activity, spirit, etc.): These bright students have sparked her enthusiasm for teaching. The arrival of the piano player really sparked the party."},{"sprigs":"1. a small spray of some plant with its leaves, flowers, etc. 2. an ornament having the form of such a spray. 3. a shoot, twig, or small branch. 4. Facetious. a scion, offspring, or heir of a family, class, etc. 5. a youth or young fellow. 6. glazier's point. 7. a headless brad. 8. Metallurgy. a small peg for reinforcing the walls of a mold. a metal insert, used to chill certain portions of cast metal, that becomes an integral part of the finished casting. 9. to mark or decorate (fabrics, pottery, etc.) with a design of sprigs. 10. to fasten with brads. 11. Horticulture. to propagate a plant, especially grass, by planting individual stolons. 12. Metallurgy. to reinforce the walls of (a mold) with sprigs. 13. to remove a sprig or sprigs from (a plant)."},{"spun":"1. a simple past tense and past participle of spin. 2. formed by or as by spinning."},{"spur":"1. a U -shaped device that slips over and straps to the heel of a boot and has a blunt, pointed, or roweled projection at the back for use by a mounted rider to urge a horse forward. 2. anything that goads, impels, or urges, as to action, speed, or achievement. 3. climbing iron. 4. Ornithology. a stiff, usually sharp, horny process on the leg of various birds, especially the domestic rooster, or on the bend of the wing, as in jacanas and screamers. 5. Pathology. a bony projection or exostosis. 6. a sharp piercing or cutting instrument fastened to the leg of a gamecock in cockfighting; gaff. 7. Physical Geography. a ridge or line of elevation projecting from or subordinate to the main body of a mountain or mountain range. 8. something that projects and resembles or suggests a gaff; sharp projection. 9. a short or stunted branch or shoot, as of a tree. 10. Typography. a short, seriflike projection from the bottom of the short vertical stroke in the capital G in some fonts. 11. wing dam. 12. Botany. a slender, usually hollow, projection from some part of a flower, as from the calyx of the larkspur or the corolla of the violet. Also called spur shoot. a short shoot bearing flowers, as in fruit trees. 13. Architecture. a short wooden brace, usually temporary, for strengthening a post or some other part. any offset from a wall, as a buttress. griffe2 . 14. Ceramics. a triangular support of refractory clay for an object being fired. 15. Railroads. spur track. 16. to prick with or as if with a spur or spurs; incite or urge on: The rider spurred his mount ruthlessly. Appreciation spurs ambition. 17. to strike or wound with the spur, as a gamecock. 18. to furnish with spurs or a spur. 19. to goad or urge one's horse with spurs or a spur; ride quickly. 20. to proceed hurriedly; press forward: We spurred onward through the night. 21. on the spur of the moment, without deliberation; impulsively; suddenly: We headed for the beach on the spur of the moment. 22. win one's spurs, to achieve distinction or success for the first time; prove one's ability or worth: Our team hasn't won its spurs yet."},{"stiffened":"1. to make stiff. 2. to become stiff. 3. to become suddenly tense, rigid, or taut, as in bracing oneself for or drawing back from shock, fear, or displeasure: He stiffened, expecting to hear the worst."},{"stoop":"1. to bend the head and shoulders, or the body generally, forward and downward from an erect position: to stoop over a desk. 2. to carry the head and shoulders habitually bowed forward: to stoop from age. 3. (of trees, precipices, etc.) to bend, bow, or lean. 4. to descend from one's level of dignity; condescend; deign: Don't stoop to argue with him. 5. to swoop down, as a hawk at prey. 6. to submit; yield. 7. Obsolete. to come down from a height. 8. to bend (oneself, one's head, etc.) forward and downward. 9. Archaic. to abase, humble, or subdue. 10. the act or an instance of stooping. 11. a stooping position or carriage of body: The elderly man walked with a stoop. 12. a descent from dignity or superiority. 13. a downward swoop, as of a hawk."},{"strife":"1. vigorous or bitter conflict, discord, or antagonism: to be at strife. 2. a quarrel, struggle, or clash: armed strife. 3. competition or rivalry: the strife of the marketplace. 4. Archaic. strenuous effort."},{"strutted":"1. to walk with a vain, pompous bearing, as with head erect and chest thrown out, as if expecting to impress observers. 2. the act of strutting. 3. a strutting walk or gait. 4. strut one's stuff, to dress, behave, perform, etc., one's best in order to impress others; show off."},{"strutted":"1. to walk with a vain, pompous bearing, as with head erect and chest thrown out, as if expecting to impress observers. 2. the act of strutting. 3. a strutting walk or gait. 4. strut one's stuff, to dress, behave, perform, etc., one's best in order to impress others; show off."},{"swoon":"1. to faint; lose consciousness. 2. to enter a state of hysterical rapture or ecstasy: The teenagers swooned at the sight of the singing star. 3. a faint or fainting fit; syncope."},{"tap":"1. to strike with a light but audible blow or blows; hit with repeated, slight blows: He tapped the door twice. 2. to make, put, etc., by tapping: to tap a nail into a wall. 3. to strike (the fingers, a foot, a pencil, etc.) upon or against something, especially with repeated light blows: Stop tapping your feet! 4. Basketball. to strike (a ball in the air) in the direction of a teammate or of the basket. 5. to enter information or produce copy by tapping on a keyboard: to tap data into a computer; to tap out a magazine article. 6. to add a thickness of leather to the sole or heel of (a boot or shoe), as in repairing. 7. to strike lightly but audibly, as to attract attention. 8. to strike light blows. 9. to tap-dance. 10. a light but audible blow: a tap on the shoulder. 11. the sound made by this. 12. a piece of metal attached to the toe or heel of a shoe, as for reinforcement or for making the tapping of a dancer more audible. 13. Basketball. an act or instance of tapping the ball: Hanson got the tap from our center, who, 6prime;9″ tall, couldn't lose a jump ball. 14. a thickness of leather added to the sole or heel of a boot or shoe, as in repairing."},{"temper":"1. a particular state of mind or feelings. 2. habit of mind, especially with respect to irritability or patience, outbursts of anger, or the like; disposition: an even temper. 3. heat of mind or passion, shown in outbursts of anger, resentment, etc. 4. calm disposition or state of mind: to be out of temper. 5. a substance added to something to modify its properties or qualities. 6. Metallurgy. the degree of hardness and strength imparted to a metal, as by quenching, heat treatment, or cold working. the percentage of carbon in tool steel. the operation of tempering. 7. Archaic. a middle course; compromise. 8. Obsolete. the constitution or character of a substance. 9. to moderate or mitigate: to temper justice with mercy. 10. to soften or tone down. 11. to bring to a proper, suitable, or desirable state by or as by blending or admixture. 12. to moisten, mix, and work up into proper consistency, as clay or mortar. 13. Metallurgy. to impart strength or toughness to (steel or cast iron) by heating and cooling. 14. to produce internal stresses in (glass) by sudden cooling from low red heat; toughen. 15. to tune (a keyboard instrument, as a piano, organ, or harpsichord) so as to make the tones available in different keys or tonalities. 16. to modify (color) by mixing with a medium. 17. Archaic. to combine or blend in due proportions. 18. Archaic. to pacify. 19. to be or become tempered."},{"thaw":"1. to pass or change from a frozen to a liquid or semiliquid state; melt. 2. to be freed from the physical effect of frost or extreme cold (sometimes followed by out): Sit by the fire and thaw out. 3. (of the weather) to become warm enough to melt ice and snow: It will probably thaw today. 4. to become less formal, reserved, or aloof: He thawed at their kindness. 5. to become less hostile or tense: International relations thawed. 6. to cause to change from a frozen to a liquid or semiliquid state; melt. 7. to free from the physical effect of frost or extreme cold; bring to a more normal temperature, especially to room temperature: I took the steaks out of the freezer and thawed them. 8. to make less cold, formal, or reserved. 9. to make less tense or hostile. 10. the act or process of thawing. 11. the act or fact of becoming less formal, reserved, or aloof. 12. a reduction or easing in tension or hostility. 13. (in winter or in areas where freezing weather is the norm) weather warm enough to melt ice and snow. 14. a period of such weather: We had a two-week thaw in January. 15. the thaw, the first day in the year when ice in harbors, rivers, etc., breaks up or loosens enough to begin flowing to the sea, allowing navigation: The Anchorage thaw came on May 18th."},{"thwart":"1. to oppose successfully; prevent from accomplishing a purpose. 2. to frustrate or baffle (a plan, purpose, etc.). 3. Archaic. to cross. to extend across. 4. a seat across a boat, especially one used by a rower. 5. a transverse member spreading the gunwales of a canoe or the like. 6. passing or lying crosswise or across; cross; transverse. 7. perverse; obstinate. 8. adverse; unfavorable. 9. across; athwart."},{"torn":"1. past participle of tear2 ."},{"trifle":"1. an article or thing of very little value. 2. a matter, affair, or circumstance of trivial importance or significance. 3. a small, inconsiderable, or trifling sum of money. 4. a small quantity or amount of anything; a little: She's still a trifle angry. 5. a literary, musical, or artistic work of a light or trivial character having no great or lasting merit; bagatelle. 6. a kind of pewter of medium hardness. 7. trifles, articles made of this. 8. English Cookery. a dessert usually consisting of custard and cake soaked in wine or liqueur, and jam, fruit, or the like. 9. to deal lightly or without due seriousness or respect: Don't trifle with me! 10. to play or toy by handling or fingering: He sat trifling with a pen. 11. to act or talk in an idle or frivolous way. 12. to pass time idly or frivolously; waste time; idle. 13. to pass or spend (time) idly or frivolously (usually followed by away)."},{"tropes":"1. Rhetoric. any literary or rhetorical device, as metaphor, metonymy, synecdoche, and irony, that consists in the use of words in other than their literal sense. an instance of this. Compare figure of speech. 2. a phrase, sentence, or verse formerly interpolated in a liturgical text to amplify or embellish. 3. (in the philosophy of Santayana) the principle of organization according to which matter moves to form an object during the various stages of its existence."},{"tug":"1. to pull at with force, vigor, or effort. 2. to move by pulling forcibly; drag; haul. 3. to tow (a vessel) by means of a tugboat. 4. to pull with force or effort: to tug at a stuck drawer. 5. to strive hard; labor; toil. 6. an act or instance of tugging; pull; haul. 7. a strenuous contest between opposing forces, groups, or persons; struggle: the tug of young minds in a seminar. 8. tugboat. 9. that by which something is tugged, as a rope or chain. 10. trace2 (def 1). any of various supporting or pulling parts."},{"twinkling":"1. an act of shining with intermittent gleams of light. 2. the time required for a wink; an instant. 3. Archaic. winking; a wink."},{"unsavory":"1. not savory; tasteless or insipid: an unsavory meal. 2. unpleasant in taste or smell; distasteful. 3. unappealing or disagreeable, as a pursuit: Poor teachers can make education unsavory. 4. socially or morally objectionable or offensive: an unsavory past; an unsavory person."},{"upheld":"1. simple past tense and past participle of uphold."},{"vast":"1. of very great area or extent; immense: the vast reaches of outer space. 2. of very great size or proportions; huge; enormous: vast piles of rubble left in the wake of the war. 3. very great in number, quantity, amount, etc.: vast sums of money. 4. very great in degree, intensity, etc.: an artisan of vast skill. 5. Literary. an immense or boundless expanse or space."},{"veriest":"1. utmost; most complete: the veriest stupidity. 2. superlative of very."},{"weary":"1. physically or mentally exhausted by hard work, exertion, strain, etc.; fatigued; tired: weary eyes; a weary brain. 2. characterized by or causing fatigue: a weary journey. 3. impatient or dissatisfied with something (often followed by of): weary of excuses. 4. characterized by or causing impatience or dissatisfaction; tedious; irksome: a weary wait. 5. to make or become weary; fatigue or tire: The long hours of work have wearied me. 6. to make or grow impatient or dissatisfied with something or at having too much of something (often followed by of): The long drive had wearied us of desert scenery. We had quickly wearied at such witless entertainment."},{"weathercock":"1. a weather vane with the figure of a rooster on it. 2. (loosely) any weather vane. 3. a person who readily adopts the latest fads, opinions, etc.: The count is the weathercock of the jet set."},{"wiry":"1. made of wire. 2. in the form of wire. 3. resembling wire, as in form, stiffness, etc.: wiry grass. 4. lean and sinew: a wiry little person. 5. produced by or resembling the sound of a vibrating wire: wiry tones."},{"withered":"1. to shrivel; fade; decay: The grapes had withered on the vine. 2. to lose the freshness of youth, as from age (often followed by away). 3. to make flaccid, shrunken, or dry, as from loss of moisture; cause to lose freshness, bloom, vigor, etc.: The drought withered the buds. 4. to affect harmfully: Reputations were withered by the scandal. 5. to abash, as by a scathing glance: a look that withered him."},{"woe":"1. grievous distress, affliction, or trouble: His woe was almost beyond description. 2. an affliction: She suffered a fall, among her other woes. 3. an exclamation of grief, distress, or lamentation."},{"yonder":"1. being in that place or over there; being that or those over there: That road yonder is the one to take. 2. being the more distant or farther: yonder side. 3. at, in, or to that place specified or more or less distant; over there."}],"config":{"file_location":"\/home\/eddie\/Downloads\/words","selector":"$(\"div.def-list\").first().text()","url":"http:\/\/dictionary.reference.com\/browse\/example?s=t"}}